"use strict";

Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.initWords = exports.chooseWord = void 0;
var words = ["올림픽", "거울", "카누", "오리", "신용카드", "돼지저금통", "커피", "개구리", "설거지", "스노우보드", "탬버린", "냉장고", "선풍기", "닭", "현금인출기", "캥거루", "컴퓨터", "손톱깍이", "엘리베이터", "수상스키", "피자", "관", "라디오", "수박", "싸움", "고래", "리모콘", "셀카봉", "휴지", "바나나", "고무줄", "공항", "옥수수", "거북이", "우산", "흔들의자", "자석", "롤러코스터", "신문", "삼겹살", "호랑나비", "레몬", "타이타닉", "스파이더맨", "터미네이터", "마스카라", "싸이", "미꾸라지", "홈런", "최홍만", "무한도전", "케익", "사랑과영혼", "아이언맨", "가위손", "향수", "자유의여신상", "꽃게", "씨름", "김연아", "상어", "당구", "발렛파킹", "암벽등반", "라면", "아이스크림", "호떡", "변비", "기쁨", "헌혈", "목도리", "볼링", "마라톤", "밸리댄스", "짜장면", "산낙지", "오뎅", "설사", "우울", "성형수술", "등목", "계산기", "섹소폰", "사랑", "헬스", "마이클잭슨", "공룡", "소방관", "비키니", "명함", "휴대폰", "고스톱", "배트맨", "바이올린", "목욕", "히틀러", "샴푸", "의사", "유혹", "사탕", "기린", "코끼리", "고슴도치", "개나리", "가재", "김", "구름", "강강술래", "간암", "과학수사", "가장", "가오리", "고물상", "기찻길", "기생충", "기러기", "고등어", "고라니", "나이테", "나방", "네이버", "나그네", "나비", "나사", "다암쥐", "다리미", "대머리", "대학교", "대법원", "다래끼", "동동주", "동충하초", "동물", "대나무", "돼지", "디지몬", "대물림", "단세포생물", "다세포생물", "다데기", "도루묵", "도토리", "도라지", "두부", "두더지", "두루미", "두반장", "두루마리", "두발검사", "라디오", "로미오", "로봇청소기", "리어카", "롱다리", "마법", "마징가", "마동석", "무지개", "무다리", "무소유", "미래", "몽유병", "몽중몽", "민달팽이", "민소매", "박자", "보물", "바닥", "보물선", "보물섬", "백제", "박테리아", "박제", "복주머니", "복날", "부모", "부자", "부역자", "스포일러", "와이파이", "연지곤지", "바리스타", "신속정확", "급속충전", "마요네즈", "신속배달", "십중팔구", "양념치킨", "중고나라", "카사노바", "저승사자", "파인애플", "공기놀이", "제기차기", "술래잡기", "어린이집", "안전제일", "헬리콥터", "카멜레온", "오토바이", "바이올린", "사자성어", "샌드위치", "유통기한", "호랑나비", "종이접기", "휴대전화", "분리수거", "총각김치", "배추김치", "해바라기", "벼룩시장", "두루치기", "초등학생", "카놀라유", "후라이팬", "고등학생", "즐겨찾기", "일기예보", "카카오톡", "신혼여행", "칠순잔치", "돌잔치", "코스프레", "일석이조", "거미", "사다리", "사슴벌레", "사고뭉치"];
var selectedWords = []; // eslint-disable-next-line import/prefer-default-export

var chooseWord = function chooseWord() {
  var quiz = words[Math.floor(Math.random() * words.length)];
  selectedWords.push(quiz);
  words = words.filter(function (word) {
    return word !== quiz;
  });
  console.log(selectedWords, words);
  return quiz;
};

exports.chooseWord = chooseWord;

var initWords = function initWords() {
  words = words.concat(selectedWords);
  console.log(words);
};

exports.initWords = initWords;