"use strict";

Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.chooseWord = void 0;
var words = ["올림픽", "거울", "카누", "오리", "신용카드", "돼지저금통", "커피", "개구리", "설거지", "스노우보드", "탬버린", "냉장고", "선풍기", "닭", "현금인출기", "캥거루", "컴퓨터", "손톱깍이", "엘리베이터", "수상스키", "피자", "관", "라디오", "수박", "싸움", "고래", "리모콘", "셀카봉", "휴지", "바나나", "고무줄", "공항", "옥수수", "거북이", "우산", "흔들의자", "자석", "롤러코스터", "신문", "삼겹살", "호랑나비", "레몬", "타이타닉", "스파이더맨", "터미네이터", "마스카라", "싸이", "미꾸라지", "홈런", "최홍만", "무한도전", "케익", "사랑과영혼", "아이언맨", "가위손", "향수", "자유의여신상", "꽃게", "씨름", "김연아", "상어", "당구", "발렛파킹", "암벽등반", "라면", "아이스크림", "호떡", "변비", "기쁨", "헌혈", "목도리", "볼링", "마라톤", "밸리댄스", "짜장면", "산낙지", "오뎅", "설사", "우울", "성형수술", "등목", "계산기", "섹소폰", "사랑", "헬스", "마이클잭슨", "공룡", "소방관", "비키니", "명함", "휴대폰", "고스톱", "배트맨", "바이올린", "목욕", "히틀러", "샴푸", "의사", "유혹", "사탕"];

var chooseWord = function chooseWord() {
  return words[Math.floor(Math.random() * words.length)];
};

exports.chooseWord = chooseWord;